{
  "backend/main.mo": "Motoko canister defining lease listings, requests, user profiles, and access‑controlled CRUD operations using Map/Set state.",
  "feature_evidence.json": "Feature evidence file listing two frontend feature changes and the related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptions of their purpose in the UI and hooks.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables for light/dark modes and applying global styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router with hash history, global layout, theme provider, and routes.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Badge showing the authenticated user’s name using profile and identity hooks.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to save their profile name before using the app.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that blocks access for unauthenticated users and shows a sign‑in prompt.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests for owners with status update actions and loading/empty states.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Modal dialog for creating or editing lease listings with validation for UUID and split ratios.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Shows owner lease listings with options to create, edit, or archive listings.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with top navigation, content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with links, social icons, and branding info.",
  "frontend/src/components/leases/EmptyState.tsx": "Generic empty-state card displaying a title and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card component showing summary details of a lease listing with a link to view more.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Promotional section linking to Unity Network mobile app downloads with store badges.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Displays a grid of embedded YouTube Shorts with titles and descriptions plus a link to the UnityNodesIO channel.",
  "frontend/src/components/navigation/TopNav.tsx": "Renders the top navigation bar with links, login status, mobile sheet menu, and logo.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests and handles submission via mutation.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Shows the tenant’s submitted lease requests in a table with status and loading/empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity to expose authentication state, principal info, and login/logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity provider and hook to manage identity loading, login flow, and status flags.",
  "frontend/src/hooks/useLeaseListings.ts": "Fetches active and owner-specific lease listings using the actor with react-query.",
  "frontend/src/hooks/useLeaseRequests.ts": "Handles submitting lease requests and fetching tenant/owner requests plus updating their status.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Provides mutations to create, update, and archive lease listings while invalidating related queries.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller’s user profile using the backend actor with proper query invalidation.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables and base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard with tabs for offers, incoming requests, and user requests plus a YouTube Shorts section.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains app workflow with step cards, educational content, and YouTube Shorts, including external UnityNodes link.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero, features, and link to browse lease listings plus app promo section.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays detailed info for a single lease listing with loading states, not‑found handling, and request submission form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Shows active lease listings with sorting, loading skeletons, empty state, and listing cards.",
  "frontend/src/pages/NotFoundPage.tsx": "404 page displaying an error message and a button to return home.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters from query or hash, persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, constraints, issues, and features for building an ICP-hosted site for UNO/ULO lease listings."
}