{
  "backend/main.mo": "Motoko backend defining types and state for user profiles, lease listings, and requests with admin‑gated CRUD and profile APIs.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files outlining their purpose and recent behavior changes.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark color tokens for the entire frontend.",
  "frontend/index.html": "Basic HTML shell loading the React application root and main entry script.",
  "frontend/src/App.tsx": "Top‑level React app configuring TanStack Router routes, layout, theme provider, and profile modal.",
  "frontend/src/components/auth/authGuardCopy.ts": "Provides centralized text for authentication and initialization error messages.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Badge showing the authenticated user's display name when available.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with error‑tolerant retry logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time authenticated users to set a profile name after actor readiness.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component that manages identity login, actor readiness, timeout handling, and renders appropriate UI states.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests with status updates, loading states, and actions to accept or reject.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Dialog for creating or editing lease listings with form validation and submit handling.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Manages owner lease listings, including creation, editing, archiving, and availability updates.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the application with top navigation, footer, and main content layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with links, social icons, branding, and attribution.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable component showing an empty-state card with title and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card displaying public lease listing info including masked code, split ratio, availability, and link to details.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Displays a marketing section promoting the Unity Network mobile app with store badges and a disclaimer.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Renders a grid of YouTube Shorts cards with embedded videos and links to UnityNodesIO instructional content.",
  "frontend/src/components/navigation/TopNav.tsx": "Implements the top navigation bar with links, auth controls, and a mobile menu drawer.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests with messaging and loading states.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Shows a table of the user's submitted lease requests with statuses and loading/empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Combines identity and actor state to determine readiness for authenticated operations and handles actor initialization retries.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity to expose authentication state, principal details, and login/logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient.",
  "frontend/src/hooks/useLeaseListings.ts": "Defines React Query hooks for fetching public and owner-specific lease listings from the backend actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Contains hooks for submitting lease requests, fetching tenant/owner requests, and updating request status.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Implements mutation hooks for creating, updating, archiving, and changing availability of lease listings.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to load and save the authenticated user's profile through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated user dashboard with tabs for offers, incoming requests, and tenant requests.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an informational page explaining how the platform works with steps and ULO lease code details.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing a hero section, feature highlights, and navigation to lease listings.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays details for a specific lease listing, including availability, masked codes, and a request form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Lists all public lease listings with sorting, loading states, and empty‑state handling.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a card message and link back to the home page.",
  "frontend/src/utils/leaseAvailability.ts": "Provides helper functions to derive lease availability labels, UI variants, and unavailable messages.",
  "frontend/src/utils/leaseCodeMasking.ts": "Utility for masking lease codes by showing the first and last segments for public display.",
  "frontend/src/utils/urlParams.ts": "Utilities for retrieving, storing, and clearing URL and session‑based parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Defines the project’s current ICP-based website plan, constraints, known issues, and existing features for a single-admin UNO lease-code listing system. Includes architectural notes, product rules, and reported bugs used for ongoing fix planning."
}