{
  "backend/main.mo": "Motoko canister defining lease listings, requests, user profiles, and access-controlled CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping a UI change to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup with custom light/dark theme variables and base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router and layout configuration with theme provider and modal wiring.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Badge showing the logged‑in user's name using Internet Identity and profile data.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth gate that blocks access and displays a login prompt for unauthenticated users.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Dashboard panel showing incoming lease requests with status update actions.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Dialog component for creating or editing lease listings with form handling and mutation calls.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Displays owner's lease listings with options to create, edit, or archive entries using dialogs and tables.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper that renders top navigation, main content, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer with links, social icons, and attribution, dynamically showing the current year.",
  "frontend/src/components/leases/EmptyState.tsx": "Simple card component that shows a placeholder message when no data is available.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card displaying lease listing details with status, metrics, and a link to the listing page.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Marketing section promoting the Unity Network mobile app with store badges and descriptions.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Section embedding a set of YouTube Shorts with titles and descriptions for instructional content.",
  "frontend/src/components/navigation/TopNav.tsx": "Responsive top navigation bar with links, authentication UI, and mobile menu.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Form component allowing authenticated users to submit lease requests with a message for a listing.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Displays the current user's submitted lease requests with status, dates, and messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication helpers exposing identity, login, logout, and principal formatting.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useLeaseListings.ts": "Hooks for fetching active and owner lease listings via the backend actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Hooks for submitting lease requests and fetching/updating tenant or owner request lists.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Mutation hooks for creating, updating, and archiving lease listings with automatic cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving the current user's profile using the backend actor.",
  "frontend/src/index.css": "Tailwind base configuration defining theme variables, dark mode settings, and global styles.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page combining offers, incoming requests, and tenant requests panels within a tab UI.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays a walkthrough of how the ULO leasing process works, including steps and an explanation of lease codes.",
  "frontend/src/pages/LandingPage.tsx": "Provides the main marketing landing page with a hero section and feature highlights for the ULO lease hub.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Shows detailed information for a specific lease listing and includes a form to submit lease requests.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Lists active lease listings with sorting options and loading or empty states.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a simple 404 page with a link back to the home page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Defines the project's state, requirements, constraints, and existing features for building a mobile‑friendly ICP‑hosted lease‑listing site with a single admin and limited ULO user functionality. Includes architectural notes, known issues, and feature metadata."
}