{
  "backend/main.mo": "Motoko canister managing user profiles, lease listings, and lease requests with access control and CRUD operations.",
  "feature_evidence.json": "Lists feature evidence entries describing required UI additions, asset usage, and text updates for app download sections.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their components, pages, and behaviors.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global layout, routes, theme provider, and profile setup modal.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Displays the logged‑in user's name in a badge after profile retrieval.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their profile name after authentication.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that shows a sign‑in prompt for unauthenticated users and renders children when logged in.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests for an owner with status badges and actions to accept or reject requests.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Dialog for creating or editing lease listings with form inputs and submit handling.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Shows the owner's lease listings with options to create, edit, or archive listings.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main application layout with top navigation and footer.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with links, social icons, and attribution.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable empty state card displaying a title and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card view of a single lease listing with details and link to its page.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Section promoting the Unity Network mobile app with store links and branding.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Displays a grid of YouTube Shorts cards using preset video IDs with titles and descriptions.",
  "frontend/src/components/navigation/TopNav.tsx": "Implements a responsive top navigation bar with links, auth controls, and a mobile sheet menu.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests and handles submission state and errors.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Fetches and displays the user's lease requests in a table with statuses and submission dates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity data into a simplified auth helper exposing login, logout, and principal info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useLeaseListings.ts": "Exposes queries for fetching active and owner-specific lease listings via the backend actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Provides query and mutation hooks for submitting and managing lease requests for tenants and owners.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Defines mutations for creating, updating, and archiving lease listings and invalidates relevant queries.",
  "frontend/src/hooks/useUserProfile.ts": "Handles fetching and saving the authenticated user's profile using actor-backed queries and mutations.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables with base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated dashboard with tabs for offers, incoming requests, and user requests plus a media section.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains the app workflow with step cards, external resources, and details about ULO lease codes.",
  "frontend/src/pages/LandingPage.tsx": "Provides the marketing landing page with hero section, CTAs, and feature highlights.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays details for a specific lease listing with loading states, not-found handling, and a request submission form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Shows active lease listings with sorting, loading skeletons, and empty-state handling.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and link back to the homepage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), store/retrieve them in sessionStorage, and persist or clear parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for the frontend.",
  "project_state.json": "Describes the project’s state, requirements, constraints, architecture notes, known issues, and existing features for an ICP‑based UNO/ULO lease site."
}