{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, lease listings, and lease requests with create/update logic and access control checks.",
  "feature_evidence.json": "Feature evidence report mapping a routing-related feature to affected frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including routing, pages, components, and hooks.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables for light and dark modes and applying global styles.",
  "frontend/index.html": "Base HTML file loading the root React app entrypoint.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router with hash-based routing, global layout, theme provider, and profile modal.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Badge showing the logged-in user's display name if authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity flow with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component displaying a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests for an owner with status updates, loading states, and empty state handling.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Modal dialog for creating or editing lease listings with form validation for UUIDs and split ratios.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Shows the owner's lease listings with options to create, edit, or archive entries and includes loading and empty views.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with top navigation, footer, and page content area.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with links, branding, social icons, and attribution.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable component that shows a centered empty-state message with icon and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card UI for displaying lease listing details with location, stats, status, and link to details page.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Marketing section promoting the Unity Network mobile app with store links and branding.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Renders a grid of YouTube Shorts instructional videos using static IDs and card layout. Includes channel link and descriptive headers.",
  "frontend/src/components/navigation/TopNav.tsx": "Implements the top navigation bar with links, authentication controls, and a mobile slide-out menu. Uses TanStack router navigation and responsive design.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests with a message. Shows a sign-in prompt when unauthenticated and handles request submission state.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Displays the user's submitted lease requests in a table with status badges. Supports loading skeletons and shows an empty state when no requests exist.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, reinitializing on identity changes. Invalidates dependent queries when the actor updates.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity state to expose auth info, login/logout, and formatted principal strings. Determines whether the user is authenticated.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing login, stored identities, and AuthClient setup. Exposes identity state and status flags to consumers.",
  "frontend/src/hooks/useLeaseListings.ts": "Fetches active and owner-specific lease listings via the actor using React Query. Queries are enabled only when the actor is ready.",
  "frontend/src/hooks/useLeaseRequests.ts": "Handles submitting lease requests and fetching tenant/owner requests via actor. Also supports updating request status with automatic cache invalidation.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Defines mutations for creating, updating, and archiving lease listings through the actor. Each mutation invalidates relevant listing queries.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller's user profile via the actor. Exposes loading states and invalidates cached profile data on save.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base typography styles.",
  "frontend/src/main.tsx": "React app entry point initializing React Query, Internet Identity provider, and rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard with tabs for offers, incoming requests, and user requests plus YouTube shorts section.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains workflow for using ULO lease codes with step cards, info sections, and external UnityNodes link.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature cards, and link to browse lease listings.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays detailed info for a specific lease listing with loading states, not-found handling, and request form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Lists active lease listings with sorting, loading skeletons, and empty state fallback.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and button linking back to home.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear specific params from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, goals, architectural notes, constraints, known issues, and existing feature records for an ICP‑hosted leasing site."
}