{
  "backend/main.mo": "Motoko actor managing lease listings, requests, and user profiles with admin/user access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of numerous frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base/theme variables with light and dark mode color definitions and global style resets.",
  "frontend/index.html": "Minimal HTML shell mounting the frontend app and loading the main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout, and global toast notifications.",
  "frontend/src/components/auth/authGuardCopy.ts": "Provides shared text for authentication and connection error messages.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Displays the logged‑in user's profile name as a badge when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states, error handling, and UI feedback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time authenticated users to save a display name, gated by actor readiness.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard that handles login, actor initialization, timeout states, and error displays before rendering protected content.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests with actions to accept or reject and handles loading and empty states.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Dialog for creating or editing lease listings with validation and submit handlers.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Manages an owner's lease listings with options to create, edit, archive, and change availability.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper including top navigation, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Application footer with links, branding, social icons, and attribution.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable empty‑state card showing a message and optional action button.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card showing a lease listing’s key details and a link to view full listing info.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "A marketing section displaying the Unity Network app logo, download badges for iOS and Android, and a disclaimer.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Renders a grid of embedded YouTube Shorts with titles, descriptions, and links to watch on YouTube.",
  "frontend/src/components/navigation/TopNav.tsx": "Top navigation bar with links, authentication controls, and a mobile drawer menu using a sheet component.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Form allowing authenticated users to submit lease requests, handling validation, submission, and loading states.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Displays a table of the user's lease requests with status badges, loading skeletons, and empty-state handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Combines identity and actor state to determine readiness, detect initialization errors, and provide a retry mechanism.",
  "frontend/src/hooks/useAuth.ts": "Simple auth helper exposing Internet Identity login state, principal strings, and login/logout actions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and exposes login, logout, and status helpers.",
  "frontend/src/hooks/useLeaseListings.ts": "Defines React Query hooks to fetch public and owner-specific lease listings using an actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Implements hooks for submitting lease requests, fetching tenant/owner requests, and updating request status.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Contains mutations for creating, updating, archiving lease listings and updating availability, with cache invalidation.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to load and save the authenticated user's profile using React Query.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated dashboard with tabs for offers, incoming requests, and user requests.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an informational page explaining how the app works, including steps and ULO lease code details.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero, feature highlights, and link to browse lease listings.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays detailed info for a specific lease listing, including availability, masked code, and request form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Shows sortable list of public lease listings with loading states and empty-state handling.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with messaging and link back to home.",
  "frontend/src/utils/leaseAvailability.ts": "Utility functions that map lease status to availability metadata and user-facing messages.",
  "frontend/src/utils/leaseCodeMasking.ts": "Masks lease codes for public display by revealing only partial segments.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using search, hash, and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, and plugins.",
  "project_state.json": "Contains project state metadata, architectural notes, known issues, and existing features for an ICP-hosted website for UNO lease-code distribution. Defines constraints, mobile-first requirements, admin restrictions, and a list of current bugs affecting authentication, media, and deployment."
}