{
  "backend/main.mo": "Motoko canister implementing lease listings, lease requests, user profiles, and access control for admin and user roles.",
  "feature_evidence.json": "Metadata report linking a UI feature update to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten map of frontend file paths to short descriptions of their functionality.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme CSS variables and global styling.",
  "frontend/index.html": "Basic HTML entry file mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout, theme provider, and profile modal.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Badge showing the logged‑in user's profile name when authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling II login/logout with loading states and adjusted label behavior.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper blocking access to protected content and showing a sign‑in prompt when unauthenticated.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests for owners with status updates, loading states, and empty handling.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Modal dialog for creating or editing lease listings with form validation and submission handlers.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Shows owner lease listings with options to create, edit, archive, and update availability.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper including top navigation, main content, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing links, social icons, and attribution with dynamic year.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable empty-state card displaying a title and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card view of a lease listing showing code, split ratio, availability, and link to details.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Marketing section promoting the Unity Network mobile app with store links and branding.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Displays a grid of embedded YouTube Shorts with titles and descriptions plus a link to the full channel.",
  "frontend/src/components/navigation/TopNav.tsx": "Renders the top navigation bar with links, login controls, and a mobile sheet menu.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests or prompts unauthenticated users to sign in.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Shows a table of the user's lease requests with status, submission date, and message, including loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity to expose authentication status, principal info, and login/logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and logic for managing Internet Identity authentication and status.",
  "frontend/src/hooks/useLeaseListings.ts": "Exposes hooks to fetch public and owner-specific lease listings using the backend actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Provides hooks for submitting lease requests, retrieving tenant/owner requests, and updating request statuses.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Defines mutations for creating, updating, archiving, and managing availability of lease listings with cache updates.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to fetch and save the current user's profile via the actor API and invalidate cached data on updates.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, and applies global typography and layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated dashboard with tabs for offers, incoming requests, and user requests, plus a YouTube shorts section.",
  "frontend/src/pages/HowItWorksPage.tsx": "Displays an overview of how the platform works, including step-by-step cards and information about ULO lease codes.",
  "frontend/src/pages/LandingPage.tsx": "Provides the marketing landing page with a hero section, app features, and links to browse lease listings.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Shows detailed information for a single lease listing, including availability, copy-to-clipboard code actions, and a request form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Lists public lease listings with sorting, loading skeletons, and empty state handling.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a simple 404 page with navigation back to the home screen.",
  "frontend/src/utils/leaseAvailability.ts": "Provides helper functions to translate lease status into UI display info and unavailable messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project’s current state, constraints, requirements, issues, and existing feature tracking for an ICP-hosted lease-listing site."
}