{
  "backend/main.mo": "Defines types and state for leases, profiles, requests, and provides CRUD operations with access control.",
  "backend/migration.mo": "Migrates old lease listing schema to the new format by wrapping optional fields and normalizing code/split ratio.",
  "feature_evidence.json": "Feature evidence report linking frontend files to requirements for updated lease listing fields and UI behavior.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend components and hooks across the app.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app root and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, hash history, theme provider, and root layout with profile modal.",
  "frontend/src/components/auth/AuthStatusBadge.tsx": "Shows the authenticated user's profile name in a header badge when available.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to enter and save their display name.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that blocks access and prompts login when the user is unauthenticated.",
  "frontend/src/components/dashboard/IncomingRequestsPanel.tsx": "Displays incoming lease requests for owners, with status updates and loading/empty states.",
  "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx": "Dialog for creating or editing lease listings with validation for UUID and split ratios.",
  "frontend/src/components/dashboard/OwnerOffersPanel.tsx": "Shows the owner's lease listings with actions to create, edit, or archive entries.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with top navigation and footer layout structure.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with links, social icons, and branding details.",
  "frontend/src/components/leases/EmptyState.tsx": "Reusable empty-state card showing a title and description.",
  "frontend/src/components/leases/LeaseListingCard.tsx": "Card component displaying lease listing info and a link to details.",
  "frontend/src/components/marketing/GetUnityNetworkAppSection.tsx": "Promotes the Unity Network mobile app with store links and branding.",
  "frontend/src/components/media/YouTubeShortsSection.tsx": "Displays a grid of embedded YouTube Shorts cards with titles and descriptions, plus a link to the UnityNodesIO channel.",
  "frontend/src/components/navigation/TopNav.tsx": "Renders the top navigation bar with links, login controls, responsive mobile menu, and branding.",
  "frontend/src/components/requests/SubmitLeaseRequestForm.tsx": "Provides a form for authenticated users to submit lease requests or prompts unauthenticated users to sign in.",
  "frontend/src/components/requests/TenantRequestsPanel.tsx": "Shows a table of the user’s lease requests with status, dates, and loading/empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity data to expose auth state, principal info, and login/logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLeaseListings.ts": "Provides queries for fetching active lease listings and the owner’s listings through the backend actor.",
  "frontend/src/hooks/useLeaseRequests.ts": "Exposes hooks to submit lease requests, fetch tenant/owner requests, and update request statuses with cache invalidation.",
  "frontend/src/hooks/useOwnerDashboard.ts": "Contains mutations for creating, updating, and archiving lease listings and handles related cache updates.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller’s user profile using backend actor queries and mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying base styles to elements and headings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, rendering the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard page with tabs for offers and requests plus a YouTube Shorts section.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains app usage through guided steps, feature cards, and ULO lease code information.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, features, and call‑to‑action links for browsing leases.",
  "frontend/src/pages/LeaseDetailsPage.tsx": "Displays detailed information for a specific lease listing, including copyable code and request form.",
  "frontend/src/pages/LeaseListingsPage.tsx": "Shows all active lease listings with sorting options and loading or empty states.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and button linking back to home.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), storing/retrieving them in sessionStorage, and cleaning parameters from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Defines the project's current state, requirements, constraints, issues, and existing features for building an ICP-hosted UNO/ULO lease-listing site."
}