{
  "kind": "build_request",
  "title": "Simplify Dashboard Create Lease Listing to Only Require ID, Lease Code, and Split Ratio",
  "projectName": "Lease Codes Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Update the Dashboard \"Create Lease Listing\" / \"Edit Lease Listing\" dialog (frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx) so the only user-input required fields are: Listing ID, Lease Code (UUID string), and Split Ratio (NLO/ULO, e.g., 60/40). Remove Location, Area, and Capacity from the required validation and from the primary form UI (they may be omitted entirely or moved into an optional/advanced section that is not required to submit).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-12"
        ],
        "quotes": [
          "for  the create lease listing in the dashboard login the only fields required are : listing id, lease code and split ratio",
          "please try again"
        ]
      },
      "acceptanceCriteria": [
        "Creating a listing from the dashboard succeeds when only Listing ID + Lease Code + Split Ratio are provided by the user (no Location/Area/Capacity input required).",
        "The form no longer blocks submission with the error \"Please fill in all required fields\" due to missing Location/Area/Capacity.",
        "User-facing labels and helper text remain in English."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure the dashboard create/update listing mutations still send valid values to the existing backend API even when Location/Area/Capacity are not entered by the user, by automatically supplying safe defaults in the dialog submit handler (e.g., Location=\"Unspecified\", Area=0, Capacity=0) while preserving the user-entered Listing ID, Lease Code, and Split Ratio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-12"
        ],
        "quotes": [
          "for  the create lease listing in the dashboard login the only fields required are : listing id, lease code and split ratio",
          "please try again"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the simplified form calls the existing actor methods (createLeaseListing/updateLeaseListing) without backend validation/trap errors due to missing Location/Area/Capacity.",
        "Lease Code UUID validation still works (invalid UUIDs are rejected with a clear inline error).",
        "Split Ratio validation still works (invalid ratios are rejected with a clear inline error)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Maintain the single-actor backend architecture; no additional backend canisters/services."
  ],
  "nonGoals": [
    "Fixing or changing the Internet Identity login flow (not requested in the latest message).",
    "Changing the backend Candid/API signatures for createLeaseListing/updateLeaseListing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}