{
  "kind": "build_request",
  "title": "Restore and clarify dashboard inputs for Lease Code, Split Ratio, and Availability",
  "projectName": "Lease Code Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Ensure the Dashboard \"My Offers\" tab provides an obvious, usable way for an admin to create and edit a lease listing’s Lease Code (UUID) and Split Ratio (NLO/ULO), including clear guidance when no listings exist so the user understands they must click \"Create Listing\" (or the edit pencil) to access the input fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the dashboard is not showing any input fields where i can update a lease code, split ratio and lease code availability status...why?"
        ]
      },
      "acceptanceCriteria": [
        "When there are zero listings, the empty state in the My Offers panel clearly explains how to add a listing and where the inputs (Lease Code, Split Ratio, Availability) are edited (Create Listing button / Edit action).",
        "When listings exist, the My Offers panel includes a short, English hint near the table header (or above the table) explaining where to edit Lease Code/Split Ratio (Edit button) and where to change Availability (Availability dropdown).",
        "No user-facing text mentions internal implementation details (e.g., actors, canisters, query keys)."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add an Availability Status control to the \"Create Lease Listing\" / \"Edit Lease Listing\" dialog so admins can set and update the lease availability status in the same place they edit Lease Code and Split Ratio, using English labels consistent with the table dropdown (Available / In Use / Archived).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the dashboard is not showing any input fields where i can update a lease code, split ratio and lease code availability status...why?"
        ]
      },
      "acceptanceCriteria": [
        "The lease editor dialog includes an \"Availability\" field with the same options currently used in the My Offers table dropdown: Available, In Use, Archived.",
        "When editing an existing listing, the dialog preselects the current listing status.",
        "Submitting the dialog updates Lease Code + Split Ratio via the existing create/update listing mutations and also persists the chosen Availability status (either by calling the existing update-availability mutation as part of submit, or by another equivalent frontend-only orchestration without requiring a backend API change).",
        "After a successful save, the My Offers table reflects the updated code/split/status without requiring a manual page refresh."
      ]
    },
    {
      "id": "REQ-53",
      "text": "If the dashboard cannot load owner listings (e.g., due to authorization or session readiness), display a concise English error state in the My Offers panel that explains the listings could not be loaded and provides a retry action, rather than silently rendering an empty area that looks like “no inputs exist.”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the dashboard is not showing any input fields where i can update a lease code, split ratio and lease code availability status...why?"
        ]
      },
      "acceptanceCriteria": [
        "If the owner listings query errors, the My Offers panel renders an error card/message (in English) with a \"Retry\" action.",
        "The error UI does not expose raw backend/internal error strings; it should be user-friendly (e.g., “Could not load your listings. Please try again.”).",
        "Retry triggers a refetch of the owner listings data and returns to normal rendering when successful."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn UI components must be composed, not modified).",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not change the public lease browsing UI behavior as part of this fix (scope is the admin dashboard editing experience).",
    "Do not introduce a new backend API unless strictly necessary; prefer using the existing updateLeaseAvailability API from the frontend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}