{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore dashboard edit inputs for Lease Code, Split Ratio, and Availability",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Clarify where admins can create/edit Lease Code and Split Ratio, and improve My Offers empty + non-empty guidance text.",
      "acceptanceCriteria": [
        "When there are zero listings, the empty state in the My Offers panel clearly explains how to add a listing and where the inputs (Lease Code, Split Ratio, Availability) are edited (Create Listing button / Edit action).",
        "When listings exist, the My Offers panel includes a short, English hint near the table header (or above the table) explaining where to edit Lease Code/Split Ratio (Edit button) and where to change Availability (Availability dropdown).",
        "No user-facing text mentions internal implementation details (e.g., actors, canisters, query keys)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OwnerOffersPanel.tsx",
          "operation": "modify",
          "description": "In the My Offers panel, add an English hint above the listings table explaining: use the Edit (pencil) action to edit Lease Code (UUID) + Split Ratio, and use the Availability dropdown to change status. Update the empty-state copy to explicitly instruct users to click “Create Listing” to access the editor inputs (Lease Code, Split Ratio, Availability). Also ensure this panel remains behind the existing authorization component patterns (RequireAuth/actor readiness) for admin-only access; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/leases/EmptyState.tsx",
          "operation": "modify",
          "description": "Allow EmptyState to optionally render richer guidance (e.g., support a ReactNode description or an optional secondary line) so the My Offers empty state can clearly instruct where to find/create/edit Lease Code, Split Ratio, and Availability without adding new routes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Add Availability control to the Create/Edit Lease Listing dialog and persist it using existing frontend mutations.",
      "acceptanceCriteria": [
        "The lease editor dialog includes an \"Availability\" field with the same options currently used in the My Offers table dropdown: Available, In Use, Archived.",
        "When editing an existing listing, the dialog preselects the current listing status.",
        "Submitting the dialog updates Lease Code + Split Ratio via the existing create/update listing mutations and also persists the chosen Availability status (either by calling the existing update-availability mutation as part of submit, or by another equivalent frontend-only orchestration without requiring a backend API change).",
        "After a successful save, the My Offers table reflects the updated code/split/status without requiring a manual page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/LeaseOfferEditorDialog.tsx",
          "operation": "modify",
          "description": "Add an Availability field to the dialog form using existing shadcn-ui Select components (compose only; do not modify anything under frontend/src/components/ui). Use English labels consistent with the table dropdown (Available / In Use / Archived), preselect current status when editing, and default sensibly when creating. On submit, orchestrate saving by calling the existing create/update listing mutation and then persisting the chosen availability via the existing update-availability mutation (frontend-only; no backend change). Ensure successful save closes the dialog and that React Query invalidation/refetch results in the updated values appearing in My Offers without manual refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOwnerDashboard.ts",
          "operation": "modify",
          "description": "If needed for cleaner orchestration, adjust or extend the existing owner-dashboard hooks to support a single dialog submit flow that can update listing fields and availability while still leveraging existing mutations and their cache invalidations (ownerListings/publicListings). Keep behavior frontend-only and consistent with current patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Show a user-friendly error state with Retry in My Offers when owner listings fail to load.",
      "acceptanceCriteria": [
        "If the owner listings query errors, the My Offers panel renders an error card/message (in English) with a \"Retry\" action.",
        "The error UI does not expose raw backend/internal error strings; it should be user-friendly (e.g., “Could not load your listings. Please try again.”).",
        "Retry triggers a refetch of the owner listings data and returns to normal rendering when successful."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/OwnerOffersPanel.tsx",
          "operation": "modify",
          "description": "Read the error/refetch state from useGetOwnerListings and render a concise, English error card/message in the My Offers panel when loading owner listings fails. Include a “Retry” button that triggers a refetch and restores normal rendering on success. Do not display raw error strings; log details to console only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLeaseListings.ts",
          "operation": "modify",
          "description": "Ensure useGetOwnerListings exposes stable error and refetch behavior suitable for a My Offers error UI (e.g., avoid masking failures as empty arrays). Keep query enabled based on existing readiness checks and allow manual refetch from the panel. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}